app/controllers/cards_controller.rb

  def index
    @cards = Card.all
---
SELECT "cards".* FROM "cards"

  def create
    @card = Card.new(card_params)

    respond_to do |format|
      if @card.save
---
INSERT INTO "cards" ("completed", "created_at", "description", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["completed", "f"], ["created_at", "2015-01-23 19:37:15.884638"], ["description", "sdsdsd"], ["updated_at", "2015-01-23 19:37:15.884638"]]

  def update
    respond_to do |format|
      if @card.update(card_params)
---
UPDATE "cards" SET "completed" = $1, "updated_at" = $2 WHERE "cards"."id" = 7  [["completed", "t"], ["updated_at", "2015-01-23 19:37:17.304993"]]

  def destroy
    @card.destroy
---
DELETE FROM "cards" WHERE "cards"."id" = $1  [["id", 6]]

    def set_card
      @card = Card.find(params[:id])
---
SELECT  "cards".* FROM "cards"  WHERE "cards"."id" = $1 LIMIT 1  [["id", 7]]